## Pandas
## Data manipulation library used for data cleaning and data analysis
## Uses 2 data structures : Series and DataFrame

## Series
## 1 dimensional array-like data structure
## Can hold any type of data
## Similar to columns

In [22]:
## Creating a series

import pandas as pd

data=[1,2,3,4]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
## Custom indexing

data=[1,2,3,4]
index=['a','b','c','d']
series=pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
## Dictionary to Series

dict={'Raheel':21,'Hassan':20,'Hamza':22}
series=pd.Series(dict)
print(series)

Raheel    21
Hassan    20
Hamza     22
dtype: int64

## DataFrame
## 2 dimensional data structure with labeled axes (rows adn columns)
## Size-mutable and potentially hetrogenous tabular data

In [40]:
## Creating a DataFrame from a dictionary of list
data={
    'Name':['Raheel','Hassan','hamza'],
    'Age':[21,20,22],
    'Location':['Khanpur','Neel Garh','Khan Bela']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age   Location
0  Raheel   21    Khanpur
1  Hassan   20  Neel Garh
2   hamza   22  Khan Bela
<class 'pandas.core.frame.DataFrame'>

In [38]:
## Importing a DataFrame 
df=pd.read_csv('StudentsPerformance.csv')
df.head(5) ## For first 5 records

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [39]:
df=pd.read_csv('StudentsPerformance.csv')
df.tail(5) ## For last 5 records

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [42]:
## Accessing data from DataFrame

df

     Name  Age   Location
0  Raheel   21    Khanpur
1  Hassan   20  Neel Garh
2   hamza   22  Khan Bela

In [43]:
## Accessing a column from DataFrame

df['Location']

0      Khanpur
1    Neel Garh
2    Khan Bela
Name: Location, dtype: object

## .loc and .iloc
## similar function unless a range is defined

In [56]:
df.loc[0][0]

C:\Users\User\AppData\Local\Temp\ipykernel_20800\2552443799.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Raheel'

In [57]:
df.iloc[0][0]

C:\Users\User\AppData\Local\Temp\ipykernel_20800\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Raheel'

In [ ]:
df.loc[0:2] ## Brings the last record from defined range

     Name  Age   Location
0  Raheel   21    Khanpur
1  Hassan   20  Neel Garh
2   hamza   22  Khan Bela

In [ ]:
df.iloc[0:2] ## Skips the last record from defined range

     Name  Age   Location
0  Raheel   21    Khanpur
1  Hassan   20  Neel Garh

In [63]:
df

     Name  Age   Location
0  Raheel   21    Khanpur
1  Hassan   20  Neel Garh
2   hamza   22  Khan Bela

In [64]:
## Accessing elements from a DataFrame using .at 
## Label-based
df.at[2,'Location']

'Khan Bela'

In [67]:
## Accessing elements using .iat
## Index-based

df.iat[1,0]

'Hassan'